# TextOrigin

## Description
Procedure TextOrigin is used to specify the origin point (location) of a newly created text object.

The position of the actual text with respect to the origin is determined by the current vertical and horizontal text justification modes.

```pascal
PROCEDURE TextOrigin(pX,pY : REAL);
```

```python
def vs.TextOrigin(p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Coordinates of text origin.|

## Examples
```pascal
else if ((tmpAngle <= 180) AND (tmpAngle > 90)) THEN
	tmpAngle := tmpAngle - 180;
TextRotate(tmpAngle);
TextJust(2);
TextOrigin(ptX + tmpVector[1] + labelVector[1], ptY + tmpVector[2] + labelVector[2]);

BEGIN
	TextOrigin(0,0);
	CreateText(Errors);
END;

BEGIN
	TextOrigin(pControlPoint01X, pControlPoint01Y);
	CreateText(pColumn_ID);
	SetTextVerticalAlign(LNewObj, 3);
	SetTextJust(LNewObj, 2);
```
```python
import vs

# Procedure TextOrigin is used to specify the origin point (location) of a
# newly created text object.
p = (0, 0)

vs.TextOrigin(p)
```
See also in tutorials: 02. Draw 2D Geometry Primitives, 07. Set Up Document Structure: Layers and Classes, 08. Attach and Read Records on Objects, 09. Dimensioning and Text Annotation

## See Also
VS Functions:
MoveTo

## Version
Availability: from All Versions

## Category
* Objects - Text